// var ps = document.querySelectorAll("p");
// var translated_ps = ["1000+ विश्वविद्यालयों से पाठ्यक्रम", , "कौरसेरा सीएफओ के अनुसार, नई शर्तें एक महत्वपूर्ण \"बदलाव\" का प्रतिनिधित्व करती हैं। आइए संख्याओं में खुदाई करें।", , "700+ निःशुल्क Google प्रमाणन", "कंप्यूटर विज्ञान", "डिजिटल विपणन", "सूचना प्रौद्योगिकी (आईटी) प्रमाणपत्र", "रणनीति, कानून और नैतिकता मॉडल के माध्यम से सफल निर्णय लेना", "सफलता: व्यावहारिक सोच कौशल", "रिसर्च एथिक्स का परिचय: लोगों के साथ काम करना", "या ब्राउज़ करें", "विषय", "या", "विश्वविद्यालय", "और अधिक जानें", "क्लास सेंट्रल उपयोगकर्ताओं द्वारा लिखी गई दसियों हज़ार समीक्षाएँ आपको सर्वोत्तम पाठ्यक्रम चुनने में मदद करती हैं।", "50 मीटर", "आगंतुकों", "3एम", "साइन-अप", "पिछले 7 दिनों में 15,543 साइन अप हुए", "पिछले 7 दिनों में 68,576 अनुसरण करता है", "पिछले 7 दिनों में 75,895 पाठ्यक्रम बुकमार्क किए गए", "पिछले 7 दिनों में 12,012 सूचियाँ बनाई गईं", "एल्हम नाज़ीफ़ मार्च 15, 2023", "अर्चिशा भर मार्च 14, 2023", "एल्हम नाज़ीफ़ मार्च 13, 2023", "अर्चिशा भर मार्च 7, 2023", "किंजल वोरा 6 मार्च 2023", "क्लास सेंट्रल कई प्रदाताओं से पाठ्यक्रम एकत्र करता है ताकि आपको लगभग किसी भी विषय पर सर्वोत्तम पाठ्यक्रम खोजने में मदद मिल सके, चाहे वे कहीं भी मौजूद हों।", "क्लास सेंट्रल © 2011-2023 गोपनीयता नीति"]
// for (let index = 0; index < ps.length; index++) {
//     const element = ps[index];
//     if (element.innerText == "") continue;
//     element.innerText = translated_ps[index];
// }


var ps = document.querySelectorAll("span");
translated_ps = ["क्लास सेंट्रल", "रैंकिंग", "संग्रह", "कंप्यूटर विज्ञान", "स्वास्थ्य और चिकित्सा",
    "अंक शास्त्र", "व्यवसाय", "मानविकी", "अभियांत्रिकी", "विज्ञान", "शिक्षा और शिक्षण", "सामाजिक विज्ञान", "कला डिजाइन", "डेटा विज्ञान",
    "प्रोग्रामिंग", "व्यक्तिगत विकास", "सूचना सुरक्षा (इन्फोसेक)", "विश्वविद्यालयों", "रिपोर्ट", "बेस्ट ऑफ ऑल टाइम", "वर्ष 2022 का सर्वश्रेष्ठ",
    "वर्ष 2021 का सर्वश्रेष्ठ", "अब तक का सबसे लोकप्रिय", "वर्ष 2022 का सर्वाधिक लोकप्रिय", "साल 2021 का सबसे लोकप्रिय", "इस महीने की शुरुआत",
    "नए ऑनलाइन पाठ्यक्रम", "सबसे लोकप्रिय", "कृत्रिम होशियारी", "एल्गोरिदम और डेटा संरचनाएं", "चीजों की इंटरनेट", "सूचान प्रौद्योगिकी",
    "कम्प्यूटर नेट्वर्किंग", "यंत्र अधिगम", "DevOps", "ध्यान लगा के पढ़ना या सीखना", "क्रिप्टोग्राफी", "क्वांटम कम्प्यूटिंग", "मानव-कंप्यूटर इंटरेक्शन (HCI)",
    "वितरित प्रणाली", "ब्लॉकचेन विकास", "ऑपरेटिंग सिस्टम", "कंप्यूटर चित्रलेख", "सभी कंप्यूटर विज्ञान देखें", "पोषण और कल्याण", "रोग और विकार",
    "सार्वजनिक स्वास्थ्य", "स्वास्थ्य देखभाल", "नर्सिंग", "शरीर रचना", "पशु चिकित्सा विज्ञान", "सतत चिकित्सा शिक्षा (सीएमई)", "सभी स्वास्थ्य व चिकित्सा देखें",
    "सांख्यिकी और संभावना", "गणित की नींव", "गणना", "गणित पृथक करें", "त्रिकोणमिति", "ज्यामिति", "बीजगणित", "प्रीकैलकुलस", "संख्या सिद्धांत",
    "साहचर्य", "गणितीय तर्क", "रैखिक प्रोग्रामिंग", "ग्राफ सिद्धांत", "समुच्चय सिद्धान्त", "समूह सिद्धांत", "सभी गणित देखें", "प्रबंधन और नेतृत्व", "वित्त",
    "उद्यमशीलता", "विपणन", "कूटनीतिक प्रबंधन", "उद्योग विशिष्ट", "व्यापारिक सूचना", "लेखांकन", "मानव संसाधन", "परियोजना प्रबंधन", "बिक्री",
    "सोच को आकार दें", "व्यापार सॉफ्टवेयर", "जोखिम प्रबंधन", "कॉर्पोरेट की सामाजिक जिम्मेदारी", "ग्राहक सेवा", "गैर-लाभकारी प्रबंधन", "नवाचार",
    "संचालन प्रबंधन", "सभी व्यवसाय देखें", "इतिहास", "साहित्य", "भाषा सीखने", "व्याकरण और लेखन", "दर्शन", "धर्म", "ईएसएल", "संस्कृति",
    "खेल", "पत्रकारिता", "नीति", "भाषा विज्ञान", "खाना", "पुस्तकालय विज्ञान", "अध्ययन", "संकट प्रबंधन", "सभी मानविकी देखें", "विद्युत अभियन्त्रण",
    "मैकेनिकल इंजीनियरिंग", "असैनिक अभियंत्रण", "रोबोटिक", "नैनो", "गिस", "कपड़ा", "उत्पादन", "बीआईएम", "पाजी", "केमिकल इंजीनियरिंग",
    "ऊर्जा प्रणाली", "अंतरिक्ष इंजिनीयरिंग", "सभी इंजीनियरिंग देखें", "रसायन विज्ञान", "भौतिक विज्ञान", "पर्यावरण विज्ञान", "खगोल", "जीवविज्ञान", "कृषि",
    "पदार्थ विज्ञान", "भू - विज्ञान", "व्यावहारिक विज्ञान", "फोरेंसिक विज्ञान", "अंतरिक्ष-विज्ञान", "सभी विज्ञान देखें", "K12", "उच्च शिक्षा", "तना",
    "शिक्षक व्यावसायिक विकास", "पाठ्यक्रम विकास", "ऑनलाइन शिक्षा", "परीक्षण तैयारी", "शिक्षा शास्त्र", "सभी शिक्षा और शिक्षण देखें", "समाज शास्त्र",
    "अर्थशास्त्र", "मनोविज्ञान", "मनुष्य जाति का विज्ञान", "राजनीति विज्ञान", "कानून", "शहरी नियोजन", "मानव अधिकार", "वहनीयता", "शासन", "पुरातत्त्व",
    "सामाजिक कार्य", "बचपन के विकास", "सभी सामाजिक विज्ञान देखें", "संगीत", "डिजीटल मीडिया", "दृश्य कला", "डिजाइन और रचनात्मकता",
    "सभी कला और डिज़ाइन देखें", "बायोइनफॉरमैटिक्स", "बड़ा डेटा", "डेटा खनन", "डेटा विश्लेषण", "डेटा विज़ुअलाइज़ेशन", "ज्यूपिटर नोटबुक",
    "सभी डेटा विज्ञान देखें", "मोबाइल विकास", "वेब विकास", "डेटाबेस", "खेल का विकास", "प्रोग्रामिंग भाषा", "सॉफ्टवेयर डेवलपमेंट",
    "क्लाउड कम्प्यूटिंग", "सभी प्रोग्रामिंग देखें", "संचार कौशल", "कैरियर विकास", "आत्म सुधार", "कौशल प्रस्तुति", "लचीलापन",
    "सभी व्यक्तिगत विकास देखें", "साइबर सुरक्षा", "नेटवर्क सुरक्षा", "नैतिक हैकिंग", "डिजिटल फोरेंसिक", "रिवर्स इंजीनियरिंग", "भेदन परीक्षण",
    "मैलवेयर विश्लेषण", "DevSecOps", "OSINT (ओपन सोर्स इंटेलिजेंस)", "धमकी खुफिया", "सूचना सुरक्षा प्रमाणपत्र", "रेड टीम", "नीली टीम",
    "सभी सूचना सुरक्षा देखें (इन्फोसेक)", "या", "रुझान", "एक्सेल", "कंप्यूटर विज्ञान", "व्यापार", "9,453 पाठ्यक्रम", "3,943 पाठ्यक्रम",
    "505 पाठ्यक्रम", "मिशिगन यूनिवर्सिटी", "हांगकांग पॉलिटेक्निक यूनिवर्सिटी", "लीड्स विश्वविद्यालय", "नि: शुल्क प्रमाण पत्र", "आइवी लीग",
    "स्टैनफोर्ड", "बेस्ट ऑफ ऑल टाइम", "कंप्यूटर विज्ञान", "वहनीयता", "एमआईटी", "गूगल", "वीरांगना", "व्यवसाय", "सर्वश्रेष्ठ पाठ्यक्रम मार्गदर्शिकाएँ",
    "सौदे और छूट", "विश्वविद्यालयों को ब्राउज़ करें", "प्रदाताओं को ब्राउज़ करें", "संस्थानों को ब्राउज़ करें", "रैंकिंग देखें", "क्लास सेंट्रल", "इस प्रकार है",
    "बुकमार्क", "सूची बनाई गई", "ऑनलाइन शिक्षा।", "मनोएल कोर्टेस मेंडेज़ द्वारा", "मार्च 14, 2023", "धवल शाह द्वारा", "13 मार्च, 2023",
    "मनोएल कोर्टेस मेंडेज़ द्वारा", "मार्च 7, 2023", "धवल शाह द्वारा", "5 मार्च, 2023", "हेबा लेडवोन द्वारा", "1 मार्च, 2023",
    "मनोएल कोर्टेस मेंडेज़ द्वारा", "फरवरी 28, 2023", "धवल शाह द्वारा", "फरवरी 27, 2023", "धवल शाह द्वारा", "20 फरवरी, 2023",
    "धवल शाह द्वारा", "15 फरवरी, 2023", "रिपोर्ट पर अधिक", "संग्रह ब्राउज़ करें", "घर", "फेसबुक", "ट्विटर", "ईमेल", "लिंक की प्रतिलिपि करें",
    "लिंक की प्रतिलिपि करें"]
for (let index = 0; index < ps.length; index++) {
    const element = ps[index];
    if (element.innerText == "") continue;
     element.innerText = translated_ps[index];
}


var ps = document.querySelectorAll("strong");
translated_ps = ["विदेश महाविद्यालय", "स्टैनफोर्ड विश्वविद्यालय", "आईआईटी खड़गपुर", "एमआईटी", "चावल विश्वविद्यालय", "आईआईटी मद्रास", "कोलम्बिया विश्वविद्यालय", "कॉर्नेल विश्वविद्यालय", "एडिनबर्ग के यू", "पर्ड्यू विश्वविद्यालय", "पेंसिल्वेनिया के यू", "ड्यूक विश्वविद्यालय", "मिशिगन के यू", "Coursera", "एडएक्स", "फ्यूचरलर्न", "Udemy", "स्वयं", "लिंक्डइन लर्निंग", "skillshare", "गूगल", "वीरांगना", "माइक्रोसॉफ्ट", "आईबीएम", "स्मिथसोनियन", "संयुक्त राष्ट्र", "ब्रिटिश परिषद", "30 मी", "13 मी", "700k", "ताजा खबर", "विश्लेषण", "चुनिंदा संग्रह"]
for (let index = 0; index < ps.length; index++) {
    const element = ps[index];
    if (element.innerText == "") continue;
    element.innerText = translated_ps[index];
}


var ps = document.querySelectorAll("h3");
translated_ps = ["विषयों", "रैंकिंग", "सर्वश्रेष्ठ पाठ्यक्रम", "सबसे लोकप्रिय पाठ्यक्रम", "संग्रह", "मासिक पाठ्यक्रम रिपोर्ट", "कंप्यूटर विज्ञान", "स्वास्थ्य और चिकित्सा", "अंक शास्त्र", "व्यवसाय", "मानविकी", "अभियांत्रिकी", "विज्ञान", "शिक्षा और शिक्षण", "सामाजिक विज्ञान", "कला डिजाइन", "डेटा विज्ञान", "प्रोग्रामिंग", "व्यक्तिगत विकास", "सूचना सुरक्षा (इन्फोसेक)", "लोकप्रिय पाठ्यक्रम", "1200+ विश्वविद्यालय", "80 प्रदाता", "1000+ संस्थान", "हाल के लेख आरएसएस फ़ीड", "MOOCs 2023 के साथ सीखना: सार अप्रैल 3rd के कारण", "ऑनलाइन शिक्षा का व्यवसाय: कौरसेरा के वित्तीय में एक गहरा गोता", "फ्यूचरलर्न का अशांत वर्ष सीईओ के प्रस्थान के रूप में मूल्य वृद्धि में समाप्त होता है", "छंटनी के तीसरे दौर के साथ मास्टरक्लास का संघर्ष जारी है", "एमओओसी पर 20 सर्वाधिक उद्धृत शोध पत्र", "EMOOCs 2023: पेपर्स के लिए कॉल [समय सीमा 15 मार्च]", "कौरसेरा की Google के साथ नई डील से कंपनी को लाखों का नुकसान हो सकता है", "1700 कौरसेरा पाठ्यक्रम जो अभी भी पूरी तरह नि:शुल्क हैं", "2022 में छंटनी से बचने वाला एकमात्र प्रमुख खिलाड़ी होने के बाद उडेमी ने ~200 कर्मचारियों की छंटनी की", "सर्वोत्तम पाठ्यक्रम मार्गदर्शिकाएँ"]
for (let index = 0; index < ps.length; index++) {
    const element = ps[index];
    if (element.innerText == "") continue;
    element.innerText = translated_ps[index];
}
var ps = document.querySelectorAll("h2");
translated_ps = ["क्लास सेंट्रल", "अपना अगला कोर्स खोजें।", "अत्यन्त साधारण", "लोकप्रिय विषय", "लोकप्रिय पाठ्यक्रम", "सर्वोत्तम पाठ्यक्रम खोजें, चाहे वे कहीं भी हों", "रैंकिंग", "में जैसा दिखा", "धवल शाह द्वारा एक निःशुल्क खाते से अधिकतम लाभ प्राप्त करें", "धवल शाह द्वारा ताजा खबर और विश्लेषण प्राप्त करें", "10 सर्वश्रेष्ठ डेटा विज्ञान पाठ्यक्रम", "10 सर्वश्रेष्ठ उपयोगकर्ता अनुभव (यूएक्स) पाठ्यक्रम", "7 सर्वश्रेष्ठ क्रिस्टल प्रोग्रामिंग पाठ्यक्रम", "10 सर्वश्रेष्ठ बहीखाता पाठ्यक्रम", "14 सर्वश्रेष्ठ मुफ्त सीएसएस लेआउट पाठ्यक्रम", "हमारे लोकप्रिय सचित्र संग्रह को ब्राउज़ करें"]
for (let index = 0; index < ps.length; index++) {
    const element = ps[index];
    if (element.innerText == "") continue;
    element.innerText = translated_ps[index];
}






// innerTexts.replace(" ","");
// console.log(innerTexts);



// var ps = document.querySelectorAll("");
// var innerTexts = ""
// for (let index = 0; index <ps.length; index++) {
//     const element = ps[index];
//     if (element.innerText == "") continue;
//    // element.innerText = translated_ps[index]; 
//     innerTexts += (element.innerText) + "\n"
// }
// console.log(innerTexts);





///////////////////////     A's code
 
// // var ps = document.querySelectorAll("a");
// // translated_ps = ["क्लाससेंट्रल", "रैंकिंग", "संग्रह", "सभी को देखें", "कंप्यूटर विज्ञान", "स्वास्थ्य और चिकित्सा", "अंक शास्त्र", "व्यवसाय", "मानविकी",
// //  "अभियांत्रिकी", "विज्ञान", "शिक्षा और शिक्षण", "सामाजिक विज्ञान", "कला डिजाइन", "आँकड़ा विज्ञान", "प्रोग्रामिंग", "व्यक्तिगत विकास",
// //   "सूचना सुरक्षा (इन्फोसेक)", "सभी विषय देखें", "विश्वविद्यालयों", "रिपोर्ट", "बेस्ट ऑफ ऑल टाइम", "बेस्ट ऑफ़ द इयर 2022", 
// //   "बेस्ट ऑफ़ द ईयर 2021", "अब तक का सबसे लोकप्रिय", "वर्ष 2022 का सर्वाधिक लोकप्रिय", "वर्ष 2021 का सर्वाधिक लोकप्रिय", 
// //   "इस महीने की शुरुआत", "न्यूऑनलाइन पाठ्यक्रम", "सबसे लोकप्रिय", "कृत्रिम होशियारी", "एल्गोरिदम और डेटा संरचनाएं", "चीजों की इंटरनेट",
// //    "सूचान प्रौद्योगिकी", "कम्प्यूटर नेट्वर्किंग", "यंत्र अधिगम", "DevOps", "ध्यान लगा के पढ़ना या सीखना", "क्रिप्टोग्राफी", "क्वांटम कम्प्यूटिंग", 
// //    "मानव-कंप्यूटर इंटरेक्शन (एचसीआई)", "वितरित प्रणाली", "ब्लॉकचेन विकास", "ऑपरेटिंग सिस्टम", "कंप्यूटर चित्रलेख", "सभी कंप्यूटर साइंस देखें",
// //     "पोषण और कल्याण", "रोग और विकार", "सार्वजनिक स्वास्थ्य", "स्वास्थ्य देखभाल", "नर्सिंग", "शरीर रचना", "पशु चिकित्सा विज्ञान",
// //      "सतत चिकित्सा शिक्षा (सीएमई)", "Viewallस्वास्थ्य और चिकित्सा", "सांख्यिकी और संभावना", "गणित की नींव", "गणना", "गणित पृथक करें", 
// //      "त्रिकोणमिति", "ज्यामिति", "बीजगणित", "प्रीकैलकुलस", "संख्या सिद्धांत", "साहचर्य", "गणितीय तर्क", "रैखिक प्रोग्रामिंग", "ग्राफ सिद्धांत",
// //       "समुच्चय सिद्धान्त", "समूह सिद्धांत", "सभी गणित देखें", "प्रबंधन और नेतृत्व", "वित्त", "उद्यमशीलता", "विपणन", "कूटनीतिक प्रबंधन", "उद्योग-विशिष्ट",
// //        "व्यापारिक सूचना", "लेखांकन", "मानव संसाधन", "परियोजना प्रबंधन", "बिक्री", "सोच को आकार दें", "व्यापार सॉफ्टवेयर", "जोखिम प्रबंधन", 
// //        "कॉर्पोरेट की सामाजिक जिम्मेदारी", "ग्राहक सेवा", "गैर-लाभकारी प्रबंधन", "नवाचार", "संचालन प्रबंधन", "सभी व्यवसाय देखें", "इतिहास", "साहित्य",
// //         "भाषा सीखने", "व्याकरण और लेखन", "दर्शन", "धर्म", "ईएसएल", "संस्कृति", "खेल", "पत्रकारिता", "नीति", "भाषा विज्ञान", "खाना",
// //          "पुस्तकालय विज्ञान", "अध्ययन", "संकट प्रबंधन", "सभी मानविकी देखें", "विद्युत अभियन्त्रण", "मैकेनिकल इंजीनियरिंग", "असैनिक अभियंत्रण", 
// //          "रोबोटिक", "नैनो", "गिस", "कपड़ा", "उत्पादन", "बीआईएम", "पाजी", "केमिकल इंजीनियरिंग", "एनर्जी सिस्टम्स", "अंतरिक्ष इंजिनीयरिंग", 
// //          "व्यूऑलइंजीनियरिंग", "रसायन विज्ञान", "भौतिक विज्ञान", "पर्यावरण विज्ञान", "खगोल", "जीवविज्ञान", "कृषि", "पदार्थ विज्ञान", "भू - विज्ञान", 
// //          "व्यावहारिक विज्ञान", "फोरेंसिक विज्ञान", "अंतरिक्ष-विज्ञान", "व्यूऑलसाइंस", "K12", "उच्च शिक्षा", "तना", "शिक्षक व्यावसायिक विकास", "पाठ्यक्रम विकास",
// //           "ऑनलाइन शिक्षा", "टेस्टप्रेप", "शिक्षा शास्त्र", "सभी शिक्षा और शिक्षण देखें", "समाज शास्त्र", "अर्थशास्त्र", "मनोविज्ञान", "मनुष्य जाति का विज्ञान", 
// //           "राजनीति विज्ञान", "कानून", "शहरी नियोजन", "मानव अधिकार", "वहनीयता", "शासन", "पुरातत्त्व", "सामाजिक कार्य", "बचपन के विकास", "सभी सामाजिक विज्ञान देखें", "संगीत", 
// //           "डिजीटल मीडिया", "दृश्य कला", "डिजाइन और रचनात्मकता", "सभी कला और डिज़ाइन देखें", "बायोइनफॉरमैटिक्स", "बड़ा डेटा", "डेटा खनन", 
// //           "डेटा विश्लेषण", "डेटा विज़ुअलाइज़ेशन", "ज्यूपिटर नोटबुक", "सभी डेटासाइंस देखें", "मोबाइल विकास", "वेब विकास", "डेटाबेस", "खेल का विकास",
// //            "प्रोग्रामिंग भाषा", "सॉफ्टवेयर डेवलपमेंट", "क्लाउड कम्प्यूटिंग", "सभी प्रोग्रामिंग देखें", "संचार कौशल", "कैरियर विकास", "आत्म सुधार", "कौशल प्रस्तुति", 
// //            "लचीलापन", "सभी व्यक्तिगत विकास देखें", "साइबर सुरक्षा", "नेटवर्क सुरक्षा", "नैतिक हैकिंग", "डिजिटल फोरेंसिक", "रिवर्स इंजीनियरिंग", "भेदन परीक्षण", 
// //            "मैलवेयर विश्लेषण", "DevSecOps", "OSINT (ओपनसोर्स इंटेलिजेंस)", "थ्रेट इंटेलिजेंस", "सूचना सुरक्षा प्रमाणपत्र", "रेड टीम", "नीली टीम", 
// //            "सभी जानकारी सुरक्षा देखें (इन्फोसेक)", "रिपोर्ट", "कौरसेरा की गूगल के साथ नई डील से कंपनी को लाखों का नुकसान हो सकता है", "धवल शाह", 
// //            "QueHacerenMomentosdeCrisis,SituacionesAltamenteEstresantes,yEmergencias", "संकट के क्षणों, अत्यधिक तनावपूर्ण स्थितियों और आपात स्थितियों में क्या करें",
// //             "2023 में लेने के लिए 10 सर्वश्रेष्ठ डेटा विज्ञान पाठ्यक्रम", "2023 में लेने के लिए 10 सर्वश्रेष्ठ उपयोगकर्ता अनुभव (यूएक्स) पाठ्यक्रम", 
// //             "LearningwithMOOCs2023: सार3 अप्रैल के कारण", "मिलने जाना", "रिपोर्ट", "लॉग इन करें", "साइन अप करें", "700+नि शुल्कGoogleप्रमाणन", 
// //             "रुझान", "कंप्यूटर विज्ञान", "9,453पाठ्यक्रम", "डिजिटल विपणन", "3,943पाठ्यक्रम", "सूचनाप्रौद्योगिकीआईटी()प्रमाण पत्र", "505पाठ्यक्रम",
// //              "रणनीति,कानून और नैतिकतामरकेमाध्यमससेफलनिर्णयलेना", "मिशिगन यूनिवर्सिटी", "सफलता:व्याहारिकसोचकौशल", "हांगकांग पॉलिटेक्निक विश्वविद्यालय", 
// //              "इंडेक्सएथिक्सकापरिचय:लोगोंकेसाथकामकरना", "लीड्स विश्वविद्यालय", "नि: शुल्क प्रमाणपत्र", "आइवी लीग", "स्टैनफोर्ड", "बेस्ट ऑफ ऑल टाइम", 
// //              "कंप्यूटर विज्ञान", "वहनीयता", "एमआईटी", "गूगल", "वीरांगना", "व्यवसाय", "बेस्ट कोर्स गाइड्स", "Dealsandछूट", "विदेश महाविद्यालय", 
// //              "स्टैनफोर्ड विश्व विद्यालय", "सख्तखड़पुर", "एम.आईटी", "चावलविश्वविद्यालय", "नमकमद्रास", "कोलम्बिया विश्व विद्यालय", "कॉर्नेल विश्व विद्यालय",
// //               "एडिनबर्गकेयू", "पर्ड्यू विश्व विद्यालय", "पेंसिल्वेनियाकेयू", "ड्यूक विश्व विद्यालय", "मिशिगनकेयू", "विश्वविद्यालयों को ब्राउज़ करें", "Coursera", "एडएक्स",
// //               "भविष्यलर्न", "Udemy", "स्वयं", "लिंक्डइन लर्निंग", "skillshare", "ब्राउजप्रदाताओं", "गिगल्स", "वीरांगना", "माइक्रोसॉफ्ट", "आईबीएम", "स्मिथसोनियन",
// //               "संयुक्त राष्ट्र", "ब्रिटिश परिषद", "संस्थानों को ब्राउज़ करें", "रैंकिंग देखें", "मैनोएल कोर्टेस मेंडेज़ द्वारा", "धवल शाह द्वारा", "मैनोएल कोर्टेस मेंडेज़ द्वारा", 
// //               "धवल शाह द्वारा", "हेबा लेडवोन द्वारा", "मैनोएल कोर्टेस मेंडेज़ द्वारा", "धवल शाह द्वारा", "धवल शाह द्वारा", "धवल शाह द्वारा", "MoreonTheReport",
// //               "संग्रह ब्राउज़ करें", "घर", "विषय के अनुसार ब्राउज करें", "कंप्यूटर विज्ञान", "मनोविज्ञान", "साइबर सुरक्षा", "स्वास्थ्य", "कानून", "लेखांकन", "वेब विकास",
// //                "प्रदाता द्वारा ब्राउज़ करें", "Coursera", "एडएक्स", "फ्यूचरलर्न", "उधम", "स्वयं", "Udemy", "लिंक्डइन लर्निंग", "विश्वविद्यालय द्वारा ब्राउज़ करें", "हार्वर्ड",
// //                 "स्टैनफोर्ड", "जॉर्जियाटेक", "मिशिगन यूनिवर्सिटी", "पर्ड्यू विश्वविद्यालय", "ड्यूक विश्वविद्यालय", "आईआईटी मद्रास", "ब्राउजबायइंस्टीट्यूशन", "गूगल",
// //                  "माइक्रोसॉफ्ट", "आईबीएम", "वीरांगना", "LinuxFoundation", "ब्रिटिश परिषद", "बिक्री बल", "रैंकिंग", "सभी समय का सर्वश्रेष्ठ ऑनलाइन पाठ्यक्रम",
// //                   "वर्ष का सर्वश्रेष्ठ ऑनलाइन पाठ्यक्रम", "अब तक के सबसे लोकप्रिय पाठ्यक्रम", "वर्ष का सर्वाधिक लोकप्रिय पाठ्यक्रम",
// //                    "अब तक के 250 टॉप फ्री कोर्सेरा कोर्स", "अब तक के 100 शीर्ष निःशुल्क पाठ्यक्रम", "सभी समय के 250 शीर्ष उदमी पाठ्यक्रम", 
// //                    "TheReportbyClassCentral", "आरएसएस फीड", "\"नया सामान्य\" जो नहीं था", "DDoSAttackonClassCentral", 
// //                    "भारत में 500+ऑनलाइन डिग्री", "हार्वर्ड का CS50 फ्री सर्टिफिकेट गाइड", "हाउओपन यूनिवर्सिटी वर्क्स", "नि: शुल्क प्रमाणपत्र और पाठ्यक्रम", 
// //                    "700+मुफ़्त Google प्रमाणपत्र", "फ्री लिंक्ड इन लर्निंग सर्टिफिकेट्स", "1700 फ्री कोर्सेरा कोर्स", "आइवी लीग ऑनलाइन पाठ्यक्रम", 
// //                    "175+फ्रीराइटिंगऑनलाइन पाठ्यक्रम", "क्लाससेंट्रल के बारे में", "फेसबुक", "ट्विटर", "Linkedin", "यूट्यूब", "हमारे बारे में", "हमसे जुड़ें", 
// //                    "सहायता केंद्र", "संपर्क करें", "फेसबुक", "ट्विटर", "ईमेल"];
// // for (let index = 0; index <ps.length; index++) {
// //     const element = ps[index];
// //     if (element.innerText == "") continue;
// //     element.innerText = translated_ps[index]; 
//    // innerTexts += (element.innerText) + "\n"
// }